yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al3136xxsss.h
#define RTC_TR1_SU               RTC_TR1_bit.SU
#define RTC_TR1_ST               RTC_TR1_bit.ST

#define RTC_TR2_MNU              RTC_TR2_bit.MNU
#define RTC_TR2_MNT              RTC_TR2_bit.MNT

#define RTC_TR3_HU               RTC_TR3_bit.HU
#define RTC_TR3_HT               RTC_TR3_bit.HT
#define RTC_TR3_PM               RTC_TR3_bit.PM

#define RTC_DR1_DU               RTC_DR1_bit.DU
#define RTC_DR1_DT               RTC_DR1_bit.DT

#define RTC_DR2_MU               RTC_DR2_bit.MU
#define RTC_DR2_MT               RTC_DR2_bit.MT
#define RTC_DR2_WDU              RTC_DR2_bit.WDU

#define RTC_DR3_YU               RTC_DR3_bit.YU
#define RTC_DR3_YT               RTC_DR3_bit.YT

#define RTC_CR1_WUCKSEL          RTC_CR1_bit.WUCKSEL
#define RTC_CR1_RATIO            RTC_CR1_bit.RATIO
#define RTC_CR1_FMT              RTC_CR1_bit.FMT

#define RTC_CR2_ALRAE            RTC_CR2_bit.ALRAE
#define RTC_CR2_WUTE             RTC_CR2_bit.WUTE
#define RTC_CR2_ALRAIE           RTC_CR2_bit.ALRAIE
#define RTC_CR2_WUTIE            RTC_CR2_bit.WUTIE

#define RTC_CR3_ADD1H            RTC_CR3_bit.ADD1H
#define RTC_CR3_SUB1H            RTC_CR3_bit.SUB1H
#define RTC_CR3_BCK              RTC_CR3_bit.BCK
#define RTC_CR3_POL              RTC_CR3_bit.POL
#define RTC_CR3_OSEL             RTC_CR3_bit.OSEL
#define RTC_CR3_COE              RTC_CR3_bit.COE

#define RTC_ISR1_ALRAWF          RTC_ISR1_bit.ALRAWF
#define RTC_ISR1_RECALPF         RTC_ISR1_bit.RECALPF
#define RTC_ISR1_WUTWF           RTC_ISR1_bit.WUTWF
#define RTC_ISR1_SHPF            RTC_ISR1_bit.SHPF
#define RTC_ISR1_INITS           RTC_ISR1_bit.INITS
#define RTC_ISR1_RSF             RTC_ISR1_bit.RSF
#define RTC_ISR1_INITF           RTC_ISR1_bit.INITF
#define RTC_ISR1_INIT            RTC_ISR1_bit.INIT

#define RTC_ISR2_ALRAF           RTC_ISR2_bit.ALRAF
#define RTC_ISR2_WUTF            RTC_ISR2_bit.WUTF
#define RTC_ISR2_TAMP1F          RTC_ISR2_bit.TAMP1F
#define RTC_ISR2_TAMP2F          RTC_ISR2_bit.TAMP2F
#define RTC_ISR2_TAMP3F          RTC_ISR2_bit.TAMP3F

#define RTC_SPRERH_PREDIV_S8     RTC_SPRERH_bit.PREDIV_S8
#define RTC_SPRERH_PREDIV_S9     RTC_SPRERH_bit.PREDIV_S9
#define RTC_SPRERH_PREDIV_S10    RTC_SPRERH_bit.PREDIV_S10
#define RTC_SPRERH_PREDIV_S11    RTC_SPRERH_bit.PREDIV_S11
#define RTC_SPRERH_PREDIV_S12    RTC_SPRERH_bit.PREDIV_S12

#define RTC_SPRERL_PREDIV_S0     RTC_SPRERL_bit.PREDIV_S0
#define RTC_SPRERL_PREDIV_S1     RTC_SPRERL_bit.PREDIV_S1
#define RTC_SPRERL_PREDIV_S2     RTC_SPRERL_bit.PREDIV_S2
#define RTC_SPRERL_PREDIV_S3     RTC_SPRERL_bit.PREDIV_S3
#define RTC_SPRERL_PREDIV_S4     RTC_SPRERL_bit.PREDIV_S4
#define RTC_SPRERL_PREDIV_S5     RTC_SPRERL_bit.PREDIV_S5
#define RTC_SPRERL_PREDIV_S6     RTC_SPRERL_bit.PREDIV_S6
#define RTC_SPRERL_PREDIV_S7     RTC_SPRERL_bit.PREDIV_S7

#define RTC_APRER_PREDIV_A       RTC_APRER_bit.PREDIV_A

#define RTC_WUTRH_WUT8           RTC_WUTRH_bit.WUT8
#define RTC_WUTRH_WUT9           RTC_WUTRH_bit.WUT9
#define RTC_WUTRH_WUT10          RTC_WUTRH_bit.WUT10
#define RTC_WUTRH_WUT11          RTC_WUTRH_bit.WUT11
#define RTC_WUTRH_WUT12          RTC_WUTRH_bit.WUT12
#define RTC_WUTRH_WUT13          RTC_WUTRH_bit.WUT13
#define RTC_WUTRH_WUT14          RTC_WUTRH_bit.WUT14
#define RTC_WUTRH_WUT15          RTC_WUTRH_bit.WUT15

#define RTC_WUTRL_WUT0           RTC_WUTRL_bit.WUT0
#define RTC_WUTRL_WUT1           RTC_WUTRL_bit.WUT1
#define RTC_WUTRL_WUT2           RTC_WUTRL_bit.WUT2
#define RTC_WUTRL_WUT3           RTC_WUTRL_bit.WUT3
#define RTC_WUTRL_WUT4           RTC_WUTRL_bit.WUT4
#define RTC_WUTRL_WUT5           RTC_WUTRL_bit.WUT5
#define RTC_WUTRL_WUT6           RTC_WUTRL_bit.WUT6
#define RTC_WUTRL_WUT7           RTC_WUTRL_bit.WUT7

#define RTC_ALRMAR1_ALSU         RTC_ALRMAR1_bit.ALSU
#define RTC_ALRMAR1_ALST         RTC_ALRMAR1_bit.ALST
#define RTC_ALRMAR1_MSK1         RTC_ALRMAR1_bit.MSK1

#define RTC_ALRMAR2_ALMNU        RTC_ALRMAR2_bit.ALMNU
#define RTC_ALRMAR2_ALMNT        RTC_ALRMAR2_bit.ALMNT
#define RTC_ALRMAR2_MSK2         RTC_ALRMAR2_bit.MSK2

#define RTC_ALRMAR3_ALHU         RTC_ALRMAR3_bit.ALHU
#define RTC_ALRMAR3_ALHT         RTC_ALRMAR3_bit.ALHT
#define RTC_ALRMAR3_PM           RTC_ALRMAR3_bit.PM
#define RTC_ALRMAR3_MSK3         RTC_ALRMAR3_bit.MSK3

#define RTC_ALRMAR4_ALDU         RTC_ALRMAR4_bit.ALDU
#define RTC_ALRMAR4_ALDT         RTC_ALRMAR4_bit.ALDT
#define RTC_ALRMAR4_WDSEL        RTC_ALRMAR4_bit.WDSEL
#define RTC_ALRMAR4_MSK4         RTC_ALRMAR4_bit.MSK4

#endif

/*-------------------------------------------------------------------------
 *      RTC bit masks
 *-----------------------------------------------------------------------*/
#define MASK_RTC_TR1_SU          0x0F
#define MASK_RTC_TR1_ST          0xF0

#define MASK_RTC_TR2_MNU         0x0F
#define MASK_RTC_TR2_MNT         0xF0

#define MASK_RTC_TR3_HU          0x0F
#define MASK_RTC_TR3_HT          0x30
#define MASK_RTC_TR3_PM          0x40

#define MASK_RTC_DR1_DU          0x0F
#define MASK_RTC_DR1_DT          0x30

#define MASK_RTC_DR2_MU          0x0F
#define MASK_RTC_DR2_MT          0x10
#define MASK_RTC_DR2_WDU         0xE0

#define MASK_RTC_DR3_YU          0x0F
#define MASK_RTC_DR3_YT          0xF0

#define MASK_RTC_CR1_WUCKSEL     0x0F
#define MASK_RTC_CR1_RATIO       0x20
#define MASK_RTC_CR1_FMT         0x40

#define MASK_RTC_CR2_ALRAE       0x01
#define MASK_RTC_CR2_WUTE        0x04
#define MASK_RTC_CR2_ALRAIE      0x10
#define MASK_RTC_CR2_WUTIE       0x40

#define MASK_RTC_CR3_ADD1H       0x01
#define MASK_RTC_CR3_SUB1H       0x02
#define MASK_RTC_CR3_BCK         0x04
#define MASK_RTC_CR3_POL         0x10
#define MASK_RTC_CR3_OSEL        0x60
#define MASK_RTC_CR3_COE         0x80

#define MASK_RTC_ISR1_ALRAWF     0x01
#define MASK_RTC_ISR1_RECALPF    0x02
#define MASK_RTC_ISR1_WUTWF      0x04
#define MASK_RTC_ISR1_SHPF       0x08
#define MASK_RTC_ISR1_INITS      0x10
#define MASK_RTC_ISR1_RSF        0x20
#define MASK_RTC_ISR1_INITF      0x40
#define MASK_RTC_ISR1_INIT       0x80

#define MASK_RTC_ISR2_ALRAF      0x01
#define MASK_RTC_ISR2_WUTF       0x04
#define MASK_RTC_ISR2_TAMP1F     0x20
#define MASK_RTC_ISR2_TAMP2F     0x40
#define MASK_RTC_ISR2_TAMP3F     0x80

#define MASK_RTC_SPRERH_PREDIV_S8 0x01
#define MASK_RTC_SPRERH_PREDIV_S9 0x02
#define MASK_RTC_SPRERH_PREDIV_S10 0x04
#define MASK_RTC_SPRERH_PREDIV_S11 0x08
#define MASK_RTC_SPRERH_PREDIV_S12 0x10

