yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al3136xxsss.h
#define TIM1_CCR1H_CCR18         TIM1_CCR1H_bit.CCR18
#define TIM1_CCR1H_CCR19         TIM1_CCR1H_bit.CCR19
#define TIM1_CCR1H_CCR110        TIM1_CCR1H_bit.CCR110
#define TIM1_CCR1H_CCR111        TIM1_CCR1H_bit.CCR111
#define TIM1_CCR1H_CCR112        TIM1_CCR1H_bit.CCR112
#define TIM1_CCR1H_CCR113        TIM1_CCR1H_bit.CCR113
#define TIM1_CCR1H_CCR114        TIM1_CCR1H_bit.CCR114
#define TIM1_CCR1H_CCR115        TIM1_CCR1H_bit.CCR115

#define TIM1_CCR1L_CCR10         TIM1_CCR1L_bit.CCR10
#define TIM1_CCR1L_CCR11         TIM1_CCR1L_bit.CCR11
#define TIM1_CCR1L_CCR12         TIM1_CCR1L_bit.CCR12
#define TIM1_CCR1L_CCR13         TIM1_CCR1L_bit.CCR13
#define TIM1_CCR1L_CCR14         TIM1_CCR1L_bit.CCR14
#define TIM1_CCR1L_CCR15         TIM1_CCR1L_bit.CCR15
#define TIM1_CCR1L_CCR16         TIM1_CCR1L_bit.CCR16
#define TIM1_CCR1L_CCR17         TIM1_CCR1L_bit.CCR17

#define TIM1_CCR2H_CCR28         TIM1_CCR2H_bit.CCR28
#define TIM1_CCR2H_CCR29         TIM1_CCR2H_bit.CCR29
#define TIM1_CCR2H_CCR210        TIM1_CCR2H_bit.CCR210
#define TIM1_CCR2H_CCR211        TIM1_CCR2H_bit.CCR211
#define TIM1_CCR2H_CCR212        TIM1_CCR2H_bit.CCR212
#define TIM1_CCR2H_CCR213        TIM1_CCR2H_bit.CCR213
#define TIM1_CCR2H_CCR214        TIM1_CCR2H_bit.CCR214
#define TIM1_CCR2H_CCR215        TIM1_CCR2H_bit.CCR215

#define TIM1_CCR2L_CCR20         TIM1_CCR2L_bit.CCR20
#define TIM1_CCR2L_CCR21         TIM1_CCR2L_bit.CCR21
#define TIM1_CCR2L_CCR22         TIM1_CCR2L_bit.CCR22
#define TIM1_CCR2L_CCR23         TIM1_CCR2L_bit.CCR23
#define TIM1_CCR2L_CCR24         TIM1_CCR2L_bit.CCR24
#define TIM1_CCR2L_CCR25         TIM1_CCR2L_bit.CCR25
#define TIM1_CCR2L_CCR26         TIM1_CCR2L_bit.CCR26
#define TIM1_CCR2L_CCR27         TIM1_CCR2L_bit.CCR27

#define TIM1_CCR3H_CCR38         TIM1_CCR3H_bit.CCR38
#define TIM1_CCR3H_CCR39         TIM1_CCR3H_bit.CCR39
#define TIM1_CCR3H_CCR310        TIM1_CCR3H_bit.CCR310
#define TIM1_CCR3H_CCR311        TIM1_CCR3H_bit.CCR311
#define TIM1_CCR3H_CCR312        TIM1_CCR3H_bit.CCR312
#define TIM1_CCR3H_CCR313        TIM1_CCR3H_bit.CCR313
#define TIM1_CCR3H_CCR314        TIM1_CCR3H_bit.CCR314
#define TIM1_CCR3H_CCR315        TIM1_CCR3H_bit.CCR315

#define TIM1_CCR3L_CCR30         TIM1_CCR3L_bit.CCR30
#define TIM1_CCR3L_CCR31         TIM1_CCR3L_bit.CCR31
#define TIM1_CCR3L_CCR32         TIM1_CCR3L_bit.CCR32
#define TIM1_CCR3L_CCR33         TIM1_CCR3L_bit.CCR33
#define TIM1_CCR3L_CCR34         TIM1_CCR3L_bit.CCR34
#define TIM1_CCR3L_CCR35         TIM1_CCR3L_bit.CCR35
#define TIM1_CCR3L_CCR36         TIM1_CCR3L_bit.CCR36
#define TIM1_CCR3L_CCR37         TIM1_CCR3L_bit.CCR37

#define TIM1_CCR4H_CCR48         TIM1_CCR4H_bit.CCR48
#define TIM1_CCR4H_CCR49         TIM1_CCR4H_bit.CCR49
#define TIM1_CCR4H_CCR410        TIM1_CCR4H_bit.CCR410
#define TIM1_CCR4H_CCR411        TIM1_CCR4H_bit.CCR411
#define TIM1_CCR4H_CCR412        TIM1_CCR4H_bit.CCR412
#define TIM1_CCR4H_CCR413        TIM1_CCR4H_bit.CCR413
#define TIM1_CCR4H_CCR414        TIM1_CCR4H_bit.CCR414
#define TIM1_CCR4H_CCR415        TIM1_CCR4H_bit.CCR415

#define TIM1_CCR4L_CCR40         TIM1_CCR4L_bit.CCR40
#define TIM1_CCR4L_CCR41         TIM1_CCR4L_bit.CCR41
#define TIM1_CCR4L_CCR42         TIM1_CCR4L_bit.CCR42
#define TIM1_CCR4L_CCR43         TIM1_CCR4L_bit.CCR43
#define TIM1_CCR4L_CCR44         TIM1_CCR4L_bit.CCR44
#define TIM1_CCR4L_CCR45         TIM1_CCR4L_bit.CCR45
#define TIM1_CCR4L_CCR46         TIM1_CCR4L_bit.CCR46
#define TIM1_CCR4L_CCR47         TIM1_CCR4L_bit.CCR47

#define TIM1_BKR_LOCK            TIM1_BKR_bit.LOCK
#define TIM1_BKR_OSSI            TIM1_BKR_bit.OSSI
#define TIM1_BKR_OSSR            TIM1_BKR_bit.OSSR
#define TIM1_BKR_BKE             TIM1_BKR_bit.BKE
#define TIM1_BKR_BKP             TIM1_BKR_bit.BKP
#define TIM1_BKR_AOE             TIM1_BKR_bit.AOE
#define TIM1_BKR_MOE             TIM1_BKR_bit.MOE

#define TIM1_OISR_OIS1           TIM1_OISR_bit.OIS1
#define TIM1_OISR_OIS1N          TIM1_OISR_bit.OIS1N
#define TIM1_OISR_OIS2           TIM1_OISR_bit.OIS2
#define TIM1_OISR_OIS2N          TIM1_OISR_bit.OIS2N
#define TIM1_OISR_OIS3           TIM1_OISR_bit.OIS3
#define TIM1_OISR_OIS3N          TIM1_OISR_bit.OIS3N

#define TIM1_DCR1_DBA            TIM1_DCR1_bit.DBA

#define TIM1_DCR2_DBL            TIM1_DCR2_bit.DBL

#endif

/*-------------------------------------------------------------------------
 *      TIM1 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_TIM1_CR1_CEN        0x01
#define MASK_TIM1_CR1_UDIS       0x02
#define MASK_TIM1_CR1_URS        0x04
#define MASK_TIM1_CR1_OPM        0x08
#define MASK_TIM1_CR1_DIR        0x10
#define MASK_TIM1_CR1_CMS        0x60
#define MASK_TIM1_CR1_ARPE       0x80

#define MASK_TIM1_CR2_CCPC       0x01
#define MASK_TIM1_CR2_COMS       0x04
#define MASK_TIM1_CR2_CCDS       0x08
#define MASK_TIM1_CR2_MMS        0x70
#define MASK_TIM1_CR2_TI1S       0x80

#define MASK_TIM1_SMCR_SMS       0x07
#define MASK_TIM1_SMCR_OCCS      0x08
#define MASK_TIM1_SMCR_TS        0x70
#define MASK_TIM1_SMCR_MSM       0x80

#define MASK_TIM1_ETR_ETF        0x0F
#define MASK_TIM1_ETR_ETPS       0x30
#define MASK_TIM1_ETR_ECE        0x40
#define MASK_TIM1_ETR_ETP        0x80

#define MASK_TIM1_DER_UDE        0x01
#define MASK_TIM1_DER_CC1DE      0x02
#define MASK_TIM1_DER_CC2DE      0x04
#define MASK_TIM1_DER_CC3DE      0x08
#define MASK_TIM1_DER_CC4DE      0x10
#define MASK_TIM1_DER_COMDE      0x20

#define MASK_TIM1_IER_UIE        0x01
#define MASK_TIM1_IER_CC1IE      0x02
#define MASK_TIM1_IER_CC2IE      0x04
#define MASK_TIM1_IER_CC3IE      0x08
#define MASK_TIM1_IER_CC4IE      0x10
#define MASK_TIM1_IER_COMIE      0x20
#define MASK_TIM1_IER_TIE        0x40
#define MASK_TIM1_IER_BIE        0x80

#define MASK_TIM1_SR1_UIF        0x01
#define MASK_TIM1_SR1_CC1IF      0x02
#define MASK_TIM1_SR1_CC2IF      0x04
#define MASK_TIM1_SR1_CC3IF      0x08
#define MASK_TIM1_SR1_CC4IF      0x10
#define MASK_TIM1_SR1_COMIF      0x20
#define MASK_TIM1_SR1_TIF        0x40
#define MASK_TIM1_SR1_BIF        0x80

#define MASK_TIM1_SR2_CC1OF      0x02
#define MASK_TIM1_SR2_CC2OF      0x04
#define MASK_TIM1_SR2_CC3OF      0x08
#define MASK_TIM1_SR2_CC4OF      0x10

#define MASK_TIM1_EGR_UG         0x01
#define MASK_TIM1_EGR_CC1G       0x02
#define MASK_TIM1_EGR_CC2G       0x04
#define MASK_TIM1_EGR_CC3G       0x08
#define MASK_TIM1_EGR_CC4G       0x10
#define MASK_TIM1_EGR_COMG       0x20
#define MASK_TIM1_EGR_TG         0x40
#define MASK_TIM1_EGR_BG         0x80

#define MASK_TIM1_CCMR1_CC1S     0x03
#define MASK_TIM1_CCMR1_OC1FE    0x04
#define MASK_TIM1_CCMR1_OC1PE    0x08
#define MASK_TIM1_CCMR1_OC1M     0x70
#define MASK_TIM1_CCMR1_OC1CE    0x80

#define MASK_TIM1_CCMR2_CC2S     0x03
#define MASK_TIM1_CCMR2_OC2FE    0x04
#define MASK_TIM1_CCMR2_OC2PE    0x08
#define MASK_TIM1_CCMR2_OC2M     0x70
#define MASK_TIM1_CCMR2_OC2CE    0x80

#define MASK_TIM1_CCMR3_CC3S     0x03
#define MASK_TIM1_CCMR3_OC3FE    0x04
#define MASK_TIM1_CCMR3_OC3PE    0x08
#define MASK_TIM1_CCMR3_OC3M     0x70
#define MASK_TIM1_CCMR3_OC3CE    0x80

